app/controllers/categories_controller.rb

	def create
		category = Category.create(params[:category])
---
INSERT INTO "categories" ("name") VALUES(NULL)