app/controllers/movies_controller.rb

SELECT * FROM "categories" WHERE ("categories"."id" = 1)
---
  def new
    @movie = Category.find(params[:category_id]).movies.new

SELECT * FROM "movies" WHERE ("movies"."id" = 1)
SELECT * FROM "categories" WHERE ("categories"."id" = 1)
---
  def show
    @movie = Movie.find(params[:id])
    @category = Category.find(@movie.category_id)

SELECT * FROM "categories" WHERE ("categories"."id" = 1)
INSERT INTO "movies" ("title", "category_id") VALUES('Komedia1', 1)
---
  def create
    category = Category.find(params[:category_id])
    category.movies.create(params[:movie])